app/controllers/bio_bytes_controller.rb

INSERT INTO `bio_bytes` (`name`, `sequence`, `created_at`, `author`, `updated_at`, `type`, `img_file_name`, `description`) VALUES('RFP', 'ATGCCCGGAGTATGAGTAGCGAGCTACTGCTAA', '2010-05-18 17:13:15', 'Steve', '2010-05-18 17:13:15', 'Linker', NULL, 'Glows green and shit')
---
  def update
  #add code to delete old byte and create new byte if type is changed
    @byte = BioByte.find(params[:id])

    if params[:byte][:type].constantize != @byte.class
      BioByte.find(params[:id]).destroy
      @byte = params[:byte][:type].constantize.new(params[:byte])
    end

    if @byte.update_attributes(params[:byte])
      @byte.sequence = @byte.sequence.upcase
      @byte.save