app/controllers/bio_bytes_controller.rb

SELECT * FROM `bio_bytes` WHERE (`bio_bytes`.`id` = 1)
---
  def show

    #get byte corr. to id
    @byte = BioByte.find(params[:id])

SELECT * FROM `bio_bytes` WHERE (`bio_bytes`.`id` = 1)
---
  def edit
    @byte = BioByte.find(params[:id])

INSERT INTO `bio_bytes` (`name`, `sequence`, `created_at`, `author`, `updated_at`, `type`, `img_file_name`, `description`) VALUES('Cream Cheese', '_CHEESE_', '2010-05-18 15:29:46', 'Steve', '2010-05-18 15:29:46', NULL, NULL, 'MMMMmm!')
---
  def create
    #linker or ORF?
    @byte=params[:byte][:type].constantize.new(params[:byte])
    @byte.sequence = @byte.sequence.upcase
    #TODO exceptions
    if @byte.save

DELETE FROM `bio_bytes` WHERE `id` = 3
SELECT * FROM `bio_bytes` WHERE (`bio_bytes`.`id` = 3)
---
  def delete
    BioByte.find(params[:id]).destroy

SELECT * FROM `bio_bytes` WHERE (`bio_bytes`.`id` = 2)
DELETE FROM `bio_bytes` WHERE `id` = 2
UPDATE `bio_bytes` SET `updated_at` = '2010-05-18 15:43:19', `description` = 'It\'s a promoter, it promotes shit.' WHERE `id` = 1
---
  def update
  #add code to delete old byte and create new byte if type is changed
    @byte = BioByte.find(params[:id])

    if params[:byte][:type].constantize != @byte.class
      BioByte.find(params[:id]).destroy
      @byte = params[:byte][:type].constantize.new(params[:byte])
    end

    if @byte.update_attributes(params[:byte])