app/controllers/construct_controller.rb

SELECT * FROM `constructs` WHERE (`constructs`.`id` = 11)
SELECT * FROM `parts` WHERE (`parts`.`construct_id` = 11) ORDER BY part_order
SELECT * FROM `bio_bytes` WHERE (`bio_bytes`.`id` = 17)
---
  def edit
    @construct = Construct.find(params[:id])
    @order = @construct.part_order
    @part =  Part.new() #for new part to be added OLD

    #get sequence
    @sequence = ""
    @order.each do |part|
      @sequence << BioByte.find(part.bio_byte_id).sequence.upcase

DELETE FROM `constructs` WHERE `id` = 1
SELECT * FROM `constructs` WHERE (`constructs`.`id` = 1)
---
  def delete
    #TODO destroy assoc. parts too!
    Construct.find(params[:id]).destroy

INSERT INTO `constructs` (`name`, `created_at`, `author`, `updated_at`, `description`) VALUES('pSB1A2', '2010-05-18 20:15:12', NULL, '2010-05-18 20:15:12', NULL)
---
  def create
    @construct = Construct.new(params[:construct])
    @construct.part_order #find byte order TODO change method name?
    if @construct.save

SELECT * FROM `constructs` WHERE (`constructs`.`id` = 11)
SELECT * FROM `parts` WHERE (`parts`.`construct_id` = 11) ORDER BY part_order
INSERT INTO `parts` (`created_at`, `updated_at`, `part_order`, `construct_id`, `bio_byte_id`) VALUES('2010-05-18 22:09:28', '2010-05-18 22:09:28', NULL, 12, 16)
UPDATE `parts` SET `updated_at` = '2010-05-18 21:59:43', `construct_id` = 11 WHERE `id` = 35
---
  def add_part
    @construct = Construct.find(params[:id])
    @construct.part_order
    p = Part.new( :bio_byte => BioByte.find(:first),
                  :construct => @construct )
    @construct.parts << p
    @construct.part_order << p
    @construct.save

SELECT * FROM `constructs` WHERE (`constructs`.`id` = 2)
INSERT INTO `parts` (`created_at`, `updated_at`, `part_order`, `construct_id`, `bio_byte_id`) VALUES('2010-05-19 02:28:05', '2010-05-19 02:28:05', 1, 2, 16)
UPDATE `parts` SET `updated_at` = '2010-05-19 02:28:05', `part_order` = 0 WHERE `id` = 56
---
  def insert_part
    @construct = Construct.find(params[:id])
    @part = Part.new(params[:part])

    @order = @construct.part_order

    @construct.part_order.insert(@part.part_order, @part)
    @construct.parts << @part
    @construct.save

SELECT * FROM `constructs` WHERE (`constructs`.`id` = 4)
SELECT * FROM `parts` WHERE (`parts`.`construct_id` = 4) ORDER BY part_order
DELETE FROM `parts` WHERE `id` = 76
UPDATE `parts` SET `updated_at` = '2010-05-19 15:54:20', `part_order` = 1 WHERE `id` = 60
---
  def delete_part

    @construct = Construct.find(params[:id])

    @part = Part.find(params[:part_id])
    @part.destroy

    @construct.part_order
    @construct.save

SELECT * FROM `constructs` WHERE (`constructs`.`id` = 7)
SELECT * FROM `parts` WHERE (`parts`.`construct_id` = 7) ORDER BY part_order
UPDATE `parts` SET `updated_at` = '2010-05-20 18:14:32', `part_order` = 3 WHERE `id` = 97
SELECT * FROM `bio_bytes` WHERE (`bio_bytes`.`id` = 16)
---
  def sort_parts

    construct = Construct.find(params[:id])
    parts = construct.parts
    parts.each do |part|
      part.part_order = params['part'].index(part.id.to_s) + 1
      part.save
    end

    @sequence = ""
    construct.part_order.each do |part|
      @sequence << BioByte.find(part.bio_byte_id).sequence.upcase

SELECT * FROM `constructs` WHERE (`constructs`.`id` = 8)
SELECT * FROM `bio_bytes` WHERE (`bio_bytes`.`name` = 'GFP') LIMIT 1
SELECT * FROM `parts` WHERE (`parts`.`construct_id` = 8) ORDER BY part_order
INSERT INTO `parts` (`created_at`, `updated_at`, `part_order`, `construct_id`, `bio_byte_id`) VALUES('2010-05-25 17:31:46', '2010-05-25 17:31:46', NULL, 8, 17)
UPDATE `parts` SET `updated_at` = '2010-05-25 17:34:39', `part_order` = 0 WHERE `id` = 113
---
  def new_part
    construct = Construct.find(params[:id])

    byte = BioByte.find(:first, :conditions => {:name => params[:part]})

    part = Part.new( :bio_byte => byte, :construct => construct )

    part.save

    construct.parts << part
    construct.part_order << part
    construct.save

SELECT * FROM `constructs` WHERE (`constructs`.`id` = 12)
SELECT * FROM `parts` WHERE (`parts`.construct_id = 12)
SELECT * FROM `bio_bytes` WHERE (`bio_bytes`.`id` = 16)
SELECT * FROM `parts` WHERE (`parts`.`id` = 196)
INSERT INTO `parts` (`created_at`, `updated_at`, `part_order`, `construct_id`, `bio_byte_id`) VALUES('2010-05-27 21:20:50', '2010-05-27 21:20:50', NULL, 12, 16)
UPDATE `parts` SET `updated_at` = '2010-05-27 21:18:53', `part_order` = 1 WHERE `id` = 172
---
  def save

    #TODO delete parts from db

    partids = params[:part]
    byteids = params[:byte]
    construct = Construct.find(params[:id])

    i=0
    partids.each do |part|
      #Who needs a new db entry?
      if part == "new"
        p = Part.new( :bio_byte => BioByte.find(byteids[i]),
                      :construct => construct )
        p.save