app/controllers/experiments_controller.rb

    def index
      admin_role  = Role.find_by_name( 'admin' )

#      @experiments = User.find_by_role_id( admin_role.id  ).experiments.find_all_by_published( true );

     #@groups = params[:search] ? Group.search( params[:search], params[:page] ) :
#		  	Group.paginate( :page => params[:page], :order => 'name' )
    if params[:search]
      @experiments = Experiment.search( params[:search], params[:page] )
---
SELECT * FROM `experiments`

  def show
    @steps = @experiment.steps.all(:order => :step_order)
---
SELECT * FROM `steps` WHERE (`steps`.experiment_id = 4)

  def add_step
    @step = Step.create(:experiment_id => @experiment)
---
INSERT INTO `steps` (`experiment_id`, `created_at`, `title`, `updated_at`, `description`, `image`) VALUES(1, '2010-05-25 16:59:03', NULL, '2010-05-25 16:59:03', NULL, NULL)

  def create
    # must pass user_id information since session id is not available
    # in the model
    @experiment = Experiment.new( params[:experiment] )
    @experiment.user = current_user

    respond_to do |format|
      if @experiment.save
---
INSERT INTO `experiments` (`created_at`, `title`, `published`, `updated_at`, `authour`, `description`, `image`) VALUES('2010-05-20 17:26:19', 'testing another', 0, '2010-05-20 17:26:19', 'mike wilson', 'i will edit this', '')

  def update
    respond_to do |format|
      if @experiment.update_attributes(params[:experiment])
---
UPDATE `experiments` SET `updated_at` = '2010-05-20 17:26:54', `description` = 'test edit' WHERE `id` = 6