app/controllers/images_controller.rb

  def thumb
    @image = Image.find(params[:id])
---
SELECT * FROM `images` WHERE (`images`.`id` = 3)

  def step
    @image = Image.find(params[:id])
---
SELECT * FROM `images` WHERE (`images`.`id` = 17)

  def index
    @images = Image.all
---
SELECT * FROM `images`

  def show
    @image = Image.find(params[:id])
---
SELECT * FROM `images` WHERE (`images`.`id` = 1)

  def edit
    @image = Image.find(params[:id])
---
SELECT * FROM `images` WHERE (`images`.`id` = 1)

  def create
    @image = Image.new(params[:image])

    respond_to do |format|
      if @image.save
---
INSERT INTO `images` (`image_height`, `created_at`, `image_filename`, `updated_at`, `owner_id`, `step_id`, `image_width`, `owner_type`) VALUES(210, '2010-06-10 21:08:01', 'wikiEcoli.jpg', '2010-06-10 21:08:01', NULL, NULL, 250, '')

  def destroy
    @image = Image.find(params[:id])
    @image.destroy
---
SELECT * FROM `images` WHERE (`images`.`id` = 2)
DELETE FROM `images` WHERE `id` = 2