app/controllers/steps_controller.rb

SELECT * FROM `steps` WHERE (`steps`.experiment_id = 4) ORDER BY step_order
---
  def index
    @steps = @experiment.steps.all( :order => "step_order" )

SELECT * FROM `steps` WHERE (`steps`.`id` = 8 AND (`steps`.experiment_id = 4))
---
  def show
    @step = @experiment.steps.find(params[:id])

SELECT * FROM `steps` WHERE (`steps`.`id` = 1 AND (`steps`.experiment_id = 4))
---
  def edit
    @step = @experiment.steps.find(params[:id])

SELECT * FROM `steps` WHERE (`steps`.experiment_id = 7) ORDER BY step_order DESC LIMIT 1
SELECT count(*) AS count_all FROM `steps` WHERE (`steps`.experiment_id = 7)
INSERT INTO `steps` (`experiment_id`, `image_id`, `created_at`, `title`, `updated_at`, `description`, `step_order`) VALUES(8, NULL, '2010-06-09 21:20:23', 'a new step', '2010-06-09 21:20:23', 'a new step without an image', NULL)
---
  def create
    @step = @experiment.steps.new(params[:step])
    @step.autogenerated=false
    # check to see if this experiment has any steps already
    i = 1  # if it doen't this is step one
    unless @experiment.steps.empty?
      # if it does, this increment the step by one
      i = @experiment.steps.last( :order => 'step_order' ).step_order + 1
    end

    @step = @experiment.steps.new(params[:step])
    @step.step_order = i

    respond_to do |format|
      if @step.save

SELECT * FROM `steps` WHERE (`steps`.`id` = 11 AND (`steps`.experiment_id = 5))
UPDATE `steps` SET `updated_at` = '2010-05-25 16:59:47', `title` = 'will it work', `image` = 'maybe', `description` = 'testing the addition of a step' WHERE `id` = 2
---
  def update
    @step = @experiment.steps.find(params[:id])

    respond_to do |format|
      if @step.update_attributes(params[:step])

SELECT * FROM `steps` WHERE (`steps`.`id` = 11 AND (`steps`.experiment_id = 5))
SELECT * FROM `steps` WHERE (`steps`.`step_order` = 1) AND (`steps`.experiment_id = 7) LIMIT 1
UPDATE `steps` SET `updated_at` = '2010-06-10 18:48:48', `step_order` = 2 WHERE `id` = 22
---
  def up
    #move up the list
    @step = @experiment.steps.find(params[:id])

    #get current order of step
    i = @step.step_order
    save = false

    unless i == 1
      # increment the order of the previous step
      other_step = @experiment.steps.find_by_step_order(i - 1)
      other_step.step_order = i
      @step.step_order = i - 1
      save = true

    end
    respond_to do |format|
         if save && other_step.save && @step.save

SELECT * FROM `steps` WHERE (`steps`.`id` = 11 AND (`steps`.experiment_id = 5))
SELECT * FROM `steps` WHERE (`steps`.`step_order` = 2) AND (`steps`.experiment_id = 8) LIMIT 1
UPDATE `steps` SET `updated_at` = '2010-06-10 20:10:47', `step_order` = 1 WHERE `id` = 23
---
  def down
    # move step down the list
    @step = @experiment.steps.find(params[:id])

    # get current order of step
    i = @step.step_order
    save = false
    unless i == @experiment.steps.length
      # decrement the order of the following step
      other_step = @experiment.steps.find_by_step_order(i + 1)
      other_step.step_order = i
      @step.step_order = i + 1
      save = true
    end
    respond_to do |format|
      if save && other_step.save && @step.save

SELECT * FROM `steps` WHERE (`steps`.`id` = 11 AND (`steps`.experiment_id = 5))
SELECT * FROM `images` WHERE (`images`.step_id = 20) LIMIT 1
DELETE FROM `images` WHERE `id` = 8
INSERT INTO `images` (`image_height`, `created_at`, `image_filename`, `updated_at`, `owner_id`, `step_id`, `image_width`, `owner_type`) VALUES(683, '2010-06-08 21:50:08', 'Boston City Flow.jpg', '2010-06-08 21:50:08', NULL, 1, 1024, NULL)
---
  def upload
    @step = @experiment.steps.find(params[:id])

    unless @step.image.blank?
	 @step.image.destroy
    end
    @image = Image.new(params[:step])
    @image.step_id = @step.id

    if @image.save

SELECT * FROM `steps` WHERE (`steps`.`id` = 6 AND (`steps`.experiment_id = 4))
DELETE FROM `steps` WHERE `id` = 3
---
  def destroy
    @step = @experiment.steps.find(params[:id])
    @step.destroy